Repository: AnthoDingo/Pisth
Catalog: Pisth/*.lproj/Localizable.strings
Languages: es, fr

# arrows.helpTextArrows
source: Swipe to send arrow keys
es: Deslice para las flechas
fr: Glissez pour les flèches.

# arrows.helpTextScroll
source: Scroll to go down / go up.
es: Deslice para navegar.
fr: Glissez pour naviguer

# bookmarks.authenticateToConnect
source: Authenticate to connect
es: Autentiquese para conectarse
fr: Authentifiez-vous pour vous connecter

# bookmarks.connecting
source: Connecting
es: Conexión
fr: Connection

# bookmarks.devices
source: Nearby devices
es: Aparatos cerca
fr: Appareils proches

# bookmarks.enterPassword
source: Enter password
es: Entre la contraseña
fr: Entrez le mot de passe

# bookmarks.enterPasswordMessage
source: Enter password for user %@.
es: Entre la contraseña para el usuario %@.
fr: Entrez le mot de passe pour l'utilisateur '%@'.

# bookmarks.enterPasswordTitle
source: Enter password
es: Entre la contraseña
fr: Entrez le mot de passe

# bookmarks.restart
source: Restart
es: Reiniciar
fr: Redémarrer

# bookmarks.resume
source: Resume
es: Continuar
fr: Continuer

# bookmarks.title
source: Bookmarks
es: Marcadores
fr: Signets

# browsers.chooseNewFolderName
source: Choose new folder name
es: Eliga el nuevo nombre del archivo
fr: Choisissez le nom du dossier

# browsers.copyHere
source: Copy here
es: Copiar aquí
fr: Copier ici

# browsers.createFolder
source: Create folder
es: Crear carpeta
fr: Créer un dossier

# browsers.createMessage
source: Choose the new file name
es: Eliga el nuevo nombre del archivo
fr: Choisissez le nom du fichier

# browsers.createTitle
source: Create blank file
es: Crear archivo vacío
fr: Créer un fichier vide

# browsers.errorCopyingFile
source: Error copying file!
es: ¡Error al copiar archivo!
fr: Erreur lors de la copie du fichier!

# browsers.errorCreatingDirectory
source: Error creating directory!
es: ¡Error al crear directorio!
fr: Erreur lors de la création du répertoire!

# browsers.errorCreatingFile
source: Error creating file!
es: ¡Error al crear archivo!
fr: Erreur lors de la création du fichier!

# browsers.errorImporting
source: Error importing file!
es: ¡Error al importar archivo!
fr: Erreur lors de l'importation du fichier!

# browsers.errorMovingFile
source: Error moving file!
es: ¡Error al mover archivo!
fr: Erreur lors du déplacement du fichier!

# browsers.errorOpeningDirectory
source: Error opening directory!
es: ¡Error al abrir directorio!
fr: Erreur lors de l'ouverture du fichier!

# browsers.folderName
source: Folder name
es: Nombre de la carpeta
fr: Nom du dossier

# browsers.import
source: Import
es: Importar
fr: Importer

# browsers.moveHere
source: Move here
es: Mover aquí
fr: Déplacer ici

# browsers.noFileInPasteboard
source: No file in the pasteboard
es: Ningún archivo en el pasteboard
fr: Aucun fichier dans le presse papier

# browsers.selectDirectoryWhereCopyFile
source: Select directory where copy file
es: Seleccione una carpeta dónde copiar el archivo
fr: Selectionnez un dossier où copier le fichier

# browsers.selectDirectoryWhereMoveFile
source: Select directory where move file
es: Seleccione una carpeta dónde mover el archivo
fr: Selectionnez un dossier où déplacer le fichier

source: Cancel
es: Cancelar
fr: Annuler

# cell.errorFile
source: Error removing file!
es: ¡Error al remover archivo!
fr: Erreur lors de la suppression du fichier!

# cell.errorRemovingDirectory
source: Error removing directory!
es: ¡Error al remover directorio!
fr: Erreur lors de la suppression du dossier!

# cell.errorRenaming
source: Error renaming file!
es: ¡Error al cambiar el nombre del archivo!
fr: Erreur lors de la modification du nom du fichier!

# cell.newFileName
source: New file name
es: Nuevo nombre del archivo
fr: Nouveau nom du fichier

# cell.paste
source: Paste
es: Pegar
fr: Coller

# cell.pasteSelection
source: Paste selection
es: Pegar selección
fr: Coller la sélection

# cell.removing
source: Removing
es: Removiendo
fr: Suppression

# cell.rename
source: Rename
es: Renombrar
fr: Renommer

# cell.renameFileMessage
source: Write the new name for %@.
es: Escriba el nuevo nombre para %@.
fr: Entrez le nouveau nom pour %@

# cell.renameFileTitle
source: Rename file
es: Renombrar archivo
fr: Renommer le fichier

# cell.toggleTopBar
source: Toggle top bar
es: Alternar barra
fr: Basculer la barre

source: Connect
es: Conectar
fr: Se connecter

# connection.changePrivKey
source: Change Private key
es: Cambiar Private key
fr: Changer la Private key

# connection.changePubKey
source: Change Public key
es: Cambiar Public key
fr: Changer la Public key

# connection.importPrivKey
source: Import Private key
es: Importar Private key
fr: Importer une Private key

# connection.importPubKey
source: Import Public key
es: Importar Public key
fr: Importer une Public key

# connection.passphrase
source: Passphrase for keys
es: Contraseña para las llaves
fr: Mot de passe pour les clées

source: Copying
es: Copiando
fr: Copie

source: Create
es: Crear
fr: Créer

# delegate.authenticateAsUser
source: Authenticate as %@
es: Autenticar como %@
fr: Authentifier comme %@

# delegate.connect
source: Connect
es: Conectar
fr: Se connecter

# delegate.connectAndRemember
source: Connect and remember
es: Connectar y recordar
fr: Se connecter et retenir

# delegate.openSSHConnection
source: Open SSH Session
es: Abrir Sesión SSH
fr: Ouvrir la session SSH

# delegate.passwordPlaceholder
source: Password
es: Contraseña
fr: Mot de passe

# delegate.selectConectionToExportFile
source: Select connection to export file
es: Seleccionar conexión par exportar archivo
fr: Selectionez une connection pour exporter un fichier

# delegate.selectConectionToUploadFile
source: Select connection to upload file
es: Seleccionar conexión para subir archivo
fr: Selectionez une connection pour envoyer le fichier

# delegate.selectFileToImport
source: Select file to import
es: Select archivo para importar
fr: Sélectionnez un fichier pour l'importer

# delegate.selectFolderWhereUploadFile
source: Select directory to upload file
es: Seleccionar directorio para subir archivo
fr: Selectionez un dossier où envoyer le fichier

# delegate.usePluginMessage
source: Do you want to use this terminal plugin? This plugin will have access to all the content of the terminal, I recommend to view the content of the plugin in the settings before using it. You can disable it from settings.
es: ¿Quieres usar esta extensión para el terminal? Esta extensión tendrá acceso a todo el contenido del terminal, le recomiendo que vea el contenido de la extensión antes de usarla. La puede desactivar desde los ajustes.
fr: Voulez vous utiliser cette extension pour le terminal? Le plugin aura accès à tout le contenu du terminal. Je vous recommande de voir le contenu de l'extension avant de l'utiliser. Vous pouvez la désactiver depuis les réglages.

# delegate.usePluginTitle
source: Use Plugin?
es: Usar extensión?
fr: Activer l'extension?

# delegate.usernamePlaceholder
source: Username
es: Usuario
fr: Utilisateur

# dir.checkForPermissions
source: Check for permissions.
es: Verifique los permisos.
fr: Vérifiez les permissions.

# dir.downloading
source: Downloading...
es: Descargando...
fr: Téléchargement...

# dir.errorAuthenticating
source: Unable to authenticate, check for username and password.
es: Error al conectarse, verifique el usuario y la contraseña.
fr: Erreur lors de l'authentification, vérifier l'utilisateur et le mot de passe.

# dir.errorConnecting
source: Unable to connect, check for your internet connection and the IP address or hostname. If you can't connect with the IP address, try with the hostname.
es: Error al conectarse, Verifique su conexión a internet y el IP o hostname del servidor. Si no puede conectarse con el IP, trate con el hostname.
fr: Errur lors de la connection, vérifiez votre connecion internet et l'IP ou le nom d'hôte du serveur. Si vous ne pouvez pas vous connecter avec l'IP, essayez avec le nom d'hôte.

# dir.errorDownloading
source: Error downloading file!
es: ¡Error al descargar archivo!
fr: Erreur lors du téléchargement du fichier!

# dir.errorOpeningSessionTitle
source: Error opening session!
es: ¡Error al abrir sesión!
fr: Erreur lors de l'ouverture de la session!

# dir.errorReadingFile
source: Error reading file!
es: ¡Error al leer archivo!
fr: Erreur lors de la lecture du fichier!

# dir.errorUploadingFileToDestination
source: Error uploading %@ to %@.
es: Error al subir %@ a %@.
fr: Erreur lors du téléversement de %@ à %@.

# dir.errorUploadingMessage
source: An error occurred uploading file.
es: Un error se produjo subiendo el archivo.
fr: Une erreur a eu lieu lors du téléversement du fichier.

# dir.errorUploadingTitle
source: Error uploading file!
es: ¡Error al subir archivo!
fr: Erreur lors du téléversement du fichier!

# dir.importFromPisth
source: Import from Pisth
es: Importar desde otra sesión
fr: Importer depuis autre session

# dir.sendFile
source: Do you want to send %@ to %@?
es: ¿Quiere mandar %@ a %@?
fr: Voulez vous envoyer %@ à %@?

# dir.sessionClosedMessage
source: An error with the connection occurred.
es: Un error con la conexión ocurrió.
fr: Une erreur avec la connection a eux lieu.

# dir.sessionClosedTitle
source: Connection was closed!
es: ¡Conexión cerrada!
fr: Connection fermée!

# dir.uploadFilesMessage
source: Do you want to upload %@ files to %@?
es: ¿Quiere subir %@ archivos a %@?
fr: Voulez vous envoyer %i fichiers à %@?

# dir.uploadFilesTitle
source: Upload %@ files?
es: Subir %@ archivos?
fr: Envoyer %i fichiers?

# editor.default
source: Default
es: Por defecto
fr: Par défaut

# editor.dontSave
source: Don't save
es: No guardarr
fr: Ne pas sauvegarder

# editor.errorOpeningFile
source: Error opening file!
es: ¡Error al abrir archivo!
fr: Erreur lors de l'ouverture du fichier!

# editor.none
source: None
es: Ning.
fr: Auc.

# editor.save
source: Save
es: Guardar
fr: Sauvegarder

# editor.saveChangesMessage
source: If you select Don't Save, all your changes will be erased!
es: ¡Si selecciona No guardar, todos los cambios serán borrados!
fr: Si vous ne sauvegarder pas, tous les changements seront effacés.

# editor.saveChangesTitle
source: Save changes?
es: ¿Guardar cambios?
fr: Sauvegarder les changements?

# editor.selectLanguage
source: Select language
es: Seleccionar lenguaje
fr: Selectionner un language

# editor.selectTheme
source: Select theme
es: Seleccionar tema
fr: Selectionner un thème

source: Error saving file!
es: ¡Error al guardar archivo!
fr: Erreur lors de l'enregistrement du fichier!

# git.commitMessage
source: Commit message:
es: Mensaje de commit:
fr: Message du commit:

# git.commitsFor
source: Commits for %@
es: Commits para %@
fr: Commits pour %@

# info.directory
source: Directory
es: Directorio
fr: Répertoire

# info.fileWithExtension
source: %@ file
es: Archivo %@
fr: Fichier %@

# info.symLink
source: Symbolic link
es: Acceso directo
fr: Lien symbolique

# info.title
source: Info
fr: Infos

source: Loading
es: Cargando
fr: Chargement

# local.createPluginMessage
source: Choose new plugin name
es: Eliga el nuevo nombre de la extensión
fr: Choisissez le nom de l'extension

# local.createPluginPlaceholder
source: New plugin name
es: Nuevo nombro
fr: Nouveau nom

# local.createPluginTitle
source: Create plugin
es: Creaar extensión
fr: Créer une extension

# local.createTerminalPlugin
source: Create terminal plugin
es: Create extensión del terminal
fr: Créer un extension du terminal

# local.editHTML
source: Edit HTML
es: Editar HTML
fr: Editer le fichier

# local.errorCreatingPluginMessage
source: Error creating index.js.
es: Error al crear index.js.
fr: Erreur lors de la création de index.js.

# local.errorCreatingPluginTitle
source: Error creating plugin!
es: ¡Error al crear extensión!
fr: Erreur lors de la création de l'extension!

# local.openFileMessage
source: View HTML page or edit?
es: Ver página HTML or editarla?
fr: Voir la page HTML ou l'editer?

# local.openFileTitle
source: Open file
es: Abrir archivo
fr: Ouvrir le fichier

# local.viewHTML
source: View HTML
es: Ver HTML
fr: Voir la page

# menu.delete
source: Delete
es: Borrar
fr: Supprimer

# menu.info
source: Info
fr: Infos

# menu.insertMode
source: Insert Mode
es: Modo inserción
fr: Mode insertion

# menu.move
source: Move
es: Mover
fr: Déplacer

# menu.openInNewPanel
source: Open In New Panel
es: Abrir En Nuevo Panel
fr: Ouvrir dans un nouveau panel

# menu.rename
source: Rename
es: Renombrar
fr: Renommer

# menu.selectionMode
source: Selection Mode
es: Modo selección
fr: Mode sélection

# menu.share
source: Share
es: Compartir
fr: Partager

source: No
fr: Non

# settings.authenticateToTurnOffAuthentication
source: Authenticate to turn off authentication
es: Autenticarse para desactivar la autenticación
fr: Authentifiez vous pour désactiver l'authentification.

# settings.cannotTurnOffAuthentication
source: Cannot turn off authentication
es: No se pudo desactivar la autenticación
fr: L'authentification n'a pas pu être désactivée.

# settings.useFaceID
source: Use Face ID
es: Usar Face ID
fr: Face ID

# settings.useTouchID
source: Use Touch ID
es: Usar Touch ID
fr: Touch ID

# terminal.accept
source: Accept
es: Aceptar
fr: Accepter

# terminal.acceptInvitation
source: Acept invitation from %@?
es: Aceptar invitación de %@?
fr: Accepter l'invitation de %@?

# terminal.authenticateToSendPasswordFor
source: Authenticate to send %@ password
es: Autenticarse para mandar la contraseña de %@
fr: Authentifiez vous pour envoyer le mot de passe de %@

# terminal.decline
source: Decline
es: Rechazar
fr: Refuser

# terminal.errorAuthenticating
source: Error authenticating! Check for username and password.
es: ¡Error al autenticarse! Verifique el usuario y contraseña.
fr: Erreur lors de l'authentification! Vérifiez l'utilisateur et le mot de passe.

# terminal.errorConnecting
source: Error connecting! Check for connection's host and your internet connection.
es: ¡Error al conectarse! Verifique el IP o hostname de la conexión.
fr: Erreur lors de la connection! Vérifier le nom d'hôte ou l'IP du serveur.

# terminal.functionKey
source: Function keys
es: Teclas función
fr: Touches fonction

# terminal.insertMode
source: Insert Mode
es: Modo inserción
fr: Mode insertion

# terminal.paste
source: Paste
es: Pegar
fr: Coller

# terminal.peerWantsToSeeTheTerminal
source: %@ wants to see the terminal.
es: %@ quiere ver el terminal.
fr: %@ voudrais voir le terminal.

# terminal.selectAction
source: Select action
es: Seleccionar acción
fr: Selectionnez une action

# terminal.selectionMode
source: Selection Mode
es: Modo selección
fr: Mode sélection

# terminal.sendCtrlKey
source: Send ^%@
es: Mandar ^%@
fr: Envoyer ^%@

# terminal.sendDownArrow
source: Send Down Arrow
es: Mandar Flecha Abajo
fr: Envoyer une flèche haute

# terminal.sendEscKey
source: Send Esc Key
es: Mandar Tecla Esc
fr: Envoyer la touche Esc

# terminal.sendLeftArrow
source: Send Left Arrow
es: Mandar Flecha Izquierda
fr: Envoyer une flèche gauche

# terminal.sendRightArrow
source: Send Right Arrow
es: Mandar Flecha Derecha
fr: Envoyer une flèche droite

# terminal.sendUpArrow
source: Send Up Arrow
es: Mandar Flecha Arriba
fr: Envoyer une flèche haute

source: Uploading
es: Subiendo
fr: Téléversement

source: Yes
es: Si
fr: Oui

# bookmarks.connections
source: Connections
es: Conexiones

source: Ok
es: Listo
